[
    "2024 HSA SSS] Srsechsl EEA",
    "멀티 페이즈 벅 컨버터의 92.6% 피크 효율과 100mA에서 60A까지 최대 효율을 달성하기 위한 부하 전류 센서가 없는 PWM/PFM 모드 전환 회로오주원1,3, 곽호진2, 김윤관2,3, 이강윤2,3성균관대학교 반도체융합공학과1, 성균관대학교 전자전기컴퓨터공학과2, 스카이칩스3 e-mail : dhwndnjs00@skku.edu, jihun3864@g.skku.edu, youckgab@skku.edu, klee@skku.eduA 92.6% Peak Efficiency Multi-Phase Buck Converter with Load Current Sensor-less PWM/PFM Mode Selection for Achieving Maximum Efficiency",
    "from 100mA to 60A",
    "Ju-Won Oh1,3, Ho-Jin Kwark2, Yun-Gwan Kim2,3 and Kang-Yoon Lee2,3Department of Semiconductor Convergence Engineering,Sungkyunkwan University1,Department of Electrical and Computer Engineering,Sungkyunkwan University2, SKAIChips3",
    "Abstract",
    "Abstract",
    "I. 서론This article presents 6-multi phase buck converter with a method to switch operational modes without the use of a current sensor for sensing the load current, accompanied by corresponding circuit designs. Based on the current levels of the inductor, the method utilizes Continuous Conduction Mode (CCM) and Discontinuous Conduction Mode (DCM) to count the occurrences of Zero Crossing Detection (ZCD) to transition to Pulse Frequency Modulation (PFM), and detects undershoots of the permissible output voltage when the load is driven to switch to Pulse Width Modulation (PWM). As a result, high efficiency can be achieved without the need to design a current sensor for detecting output current, attaining a maximum efficiency of 92.6% and a maximum allowable output current of 60A. The multi-phase buck converter proposed in this paper was fabricated using a 130nm BCD process and designed with a footprint of 24mm².오늘날의 전원 공급 환경에서는 PC, 서버, 데이터 센터 및 주변 기기가 데이터 시대에 부합하는 점점 더 높은 전력 요구를 중요하게 생각하고 있다. 이러한 높은 수요를 해결하기 위해 멀티 페이즈 컨버터 기반의 레귤레이터가 다양한 전원 공급원으로 일반화되고 있다. 고전력 시스템을 위해 설계된 멀티 페이즈 벅 컨버터는 넓은 범위에서 높은 평균 효율을 유지하기 위해 부하에 따라 사용되는 벅 컨버터 코어의 수를 조정한다.",
    "a그러나 매우 낮은 부하 전력 조건에서는 표준 벅 컨버터 펄스 폭 변조(PWM)를 사용하는 단일 코어의 활용이 최대 효율을 유지하는 데 한계를 제공한다. 따라서 펄스 주파수 변조(PFM)를 사용해야 하며, 이는 PFM 작동이 필요한 순간을 식별하기 위해 부하 감지를 위한 전류 센서가 필요하다. 부하 전력을 감지하기 위해 여러 전류 센서 옵션이 제안되었지만, 각 유형의 특성에서 발생하는 단점은 변환기의 전반적인 효율성과 성능을 저하시킨다[1]. 본 논문에서는 전류 센서에 의존하지 않고 PWM/PFM 모드 전환 방법을 제안하여 전류 센서 사용과 관련된 단점을 제거하는 혁신적인 접근 방식을 제안한다.2024 HSA SSS] Srsechsl EEAVin Pulse Width Modulation ENprm ENewu Vzep<1:6> Gate Driver Control / Auto- Phase Controller YF Off Time Gen <F \\ On Time Gen i SERV Multi-Phase Buck Core Pulse Frequency Modulation그림 2. 제안하는 멀티 페이즈 벅 컨버터의 탑 블록 다이어그램그림 1은 제안된 Current Sensor-less 접근 방식의 개념을 설명한다. 인덕터의 DC 수준은 벅 컨버터의 부하 크기에 따라 변하며, 부하 크기가 줄어들수록 감소한다. 이 전환은 변환기가 연속 전도 모드(Continuous Conduction Mode, CCM)에서 불연속 전도 모드(Discontinuous Conduction Mode, DCM)로 작동하게 하며, 이는 제로 전류 탐지기(Zero Current Detector, ZCD)에 의해 감지되고 판단될 수 있다.그림 1. 벅 컨버터에서 사용되는 인덕터 전류의 특성본 논문에서 2장과 3장에서 이러한 효율 특성을 달성하기 위해 필요한 구조와 실험 결과, 그리고 그 기초가 되는 아이디어를 제시하고 4장에서 결론으로 마무리하자 한다.II. 본론2.1 Top Architecture그림 2는 제안된 멀티 페이즈 벅 컨버터의 전체 구조를 보여준다. 벅 컨버터는 여섯 개의 병렬 코어로 구성되어 있으며, 이 코어에 신호를 전달하는 드라이버와 위상을 조절하는 회로가 포함되어 있다. PWM 회로는 PWM 작동을 용이하게 하기 위해 증폭기, 보상 네트워크, 톱니형 파형 생성기 및 비교기 등으로 구성된다. 또한, 이 회로(그림 2)는 일정 온타임 동작을 위한 온타임 생성기, 제로 전류 탐지기에 반응하여 신호를 생성하는 오프타임 생성기, 그리고 경량 부하 상황에서 PFM 모드로 작동할 때 중간 부하 조건을 간접적으로 감지하기 위한 비교기를 포함하고 있다. 설계에는 영 전류 감지를 위한 ZCD 회로와 모드 선택기도 포함되어 있다.그림 3은 멀티 페이즈 벅 컨버터의 작동에 대한 타이밍 다이어그램을 제시한다. 멀티 페이즈 벅 컨버터가 작동을 시작하면 처음에는 PWM 모드로 전압 출력을 생성한다. 출력 전압이 설정되고 안정화가 이루어진 후, 모드 선택기가 활성화되어 ZCD 신호를 탐지하여 PWM과 PFM 작동 간의 선택을 가능하게 한다. 작동 모드에 관계없이 6상 구성에서 ZCD 신호의 약 9회 탐지는 경량 부하 조건을 나타내며, 이로 인해 변환기가 PFM 모드로 전환된다.이후 PFM 작동 중에 변환기는 출력 전압을 기준 전압과 비교하여 중량 부하 아래에서 PFM 작동에 부적합한 조건을 감지한다. 이러한 감지가 이루어지면 변환기는 중량 부하를 관리하기 위해 강제로 PWM 작동으로 되돌아간다. 이 원리는 전류 센서 없이 작동 모드를 선택하는 접근 방식을 제안하여 최적의 효율2024 HSA SSS] Srsechsl EEA ryVOUT som PWM_EN PFM_EN : ce @® When the ZCD is detected a Vecan specific number of times (9 - times), PFM mode is enabled. SCAN START Vocpet:6> PWM_FORCE _BOOT Vueavyany) VX<1:6> loa | 4uA 30A 41UA OS OS Oe OT OE OT IT TT TS Te TS TD TE Ie DO TT TS ne ae Te aT a",
    "그림 6. 제안하는 멀티 페이즈 벅 컨버터의 탑 시뮬레이션",
    "을 달성할 수 있도록 한다.Vueavy Veepe1 26> ENpan Light Load Heavy Load그림 3. 멀티 페이즈 벅 컨버터 mode selection의 타이밍 다이어그램그림 4는 제안된 모드 선택 회로의 블록 다이어그램을 보여준다. VSCAN은 출력 전압을 기준 전압과 비교하는 비교기로부터 파생된 신호로, 출력 전압이 준비되었을 때 높은 신호로 정의된다. 또한, 외부에서 적용된 ZCD 신호에 기반하여 카운터가 9까지 카운트하며, 이 카운트가 달성되면 D- 플립플롭의 CLK 신호를 트리거하여 PFM 활성화(EN) 신호를 출력하게 된다. 더욱이, PFM 작업 중에 VHEAVY 신호가 적용되면 시스템이 리셋되고 PWM 작업이 시작되므로, 작동 모드 간의 원활한 전환이 가능해진다.Ⅲ. 실험 결과2.2 Mode Selector그림 5. 제안하는 멀티 페이즈 벅 컨버터의 레이아웃zcD Counter Vzcp«1: Viteavy그림 4. Mode selector의 블록 다이어그램그림 5는 제안된 다상 벅 컨버터의 탑 레이아웃 디자인을 보여준다. 이 설계는 BCD 130nm 프로세스를 사용하며, 여섯 개의 벅 컨버터 코어가 양쪽에 위치해 있다. 중앙에는 전력 관리 유닛(PMU),202414 CHBIMALS St jor tH a Bi a pay or re A표 1. 제안하는 컨버터의 성능 비교표Publication ISSCC[2] VLSI. [3] ISSCC [4] TCAS.II [5] This Work Technology (nm) 22 22 4 28 130 VIN (V) 1.6-2 2.7-4.5 1.8 2.7 3.3 VOUT (V) 0.7-1.2 0.7-1.8 1 0.6-1.5 0.75 Max IOUT (A) 2.4 8 12 12 60 Peak Efficiency (%) 89.1 83 91.5 88.3 92.6자동 위상 제어(APC) 및 PWM과 PFM 작동을 위한 다양한 제어 회로가 포함되어 있다. 전체 레이아웃 크기는 24 mm²로 설계되었다.증했다. 비교 문헌에서 보고된 최고 효율은 91.5%였 으나, 제안된 구조는 최대 92.6%의 효율을 달성했다.그림 6은 제안된 멀티 페이즈 벅 컨버터의 탑 시뮬 레이션을 보여준다. 이전에 설명한 타이밍 다이어그램 에 따르면, 초기 출력 전압 형성 과정은 강제 PWM 모드에서 작동한다. 출력 전압이 안정화되면 VSCAN 신 호가 활성화되어 스캔 프로세스가 시작된다. 경량 부 하의 경우, 시스템은 ZCD 신호를 카운트하며, 카운트 가 9를 초과하면 PFM 모드로 전환된다. 이후 중량 부 하를 구동할 때 VHEAVY 신호가 나타나면 PWM 모드 로 다시 전환된다.9% eM TPM os 92 sus = a Fy gs 2& 9 iD cos 89 88.5 a 0.10.2040608 1 2 3 4 5 6 8 10 15 20 25 30 35 40 45 50 55 60 Load (A)그림 7. 멀티 페이즈 전력 전달 효율 그래프Ⅳ. 결론본 논문에서는 부하 전류를 감지하기 위한 전류 센서 없이 작동 모드를 전환하는 방법과 이에 따른 회로 설계를 제안한다. 이 방법은 인덕터의 전류 수준에 기반하여 0 전류 감지기(ZCD)의 발생 횟수를 카운트하여 펄스 주파수 변조(PFM)로 전환하고, 부하가 구동될 때 허용 출력 전압의 언더슈트(Under-Shoot)를 감지하여 펄스 폭 변조(PWM)로 전환한다. 그 결과, 출력 전류를 감지하기 위한 전류 센서를 설계할 필요 없이 높은 효율을 달성할 수 있으며, 최대 92.6%의 효율과 최대 허용 출력 전류 60A를 달성한다. 본 논문에서 제안하는 멀티 페이즈 벅 컨버터는 130nm BCD 프로세스를 사용하여 제작되었으며, 면적은 24mm²로 설계되었다.감사의 글 본 연구는 2024년도 산업통상자원부 및 산업기술평가관리원(KEIT) 연구비 지원에 의한 연구임(20016266)그림 7은 제안된 멀티 페이즈 벅 컨버터의 탑 시뮬 레이션에 대한 효율 결과를 제시한다. 부하 전류가 설 정된 후 안정화를 거쳐 평균 입력 및 출력 전력 값을 얻어 효율을 계산했다. 모드 전환은 약 6A에서 발생 하였으며, PFM 모드에서 약 92.3%의 피크 효율과 PWM 모드에서 약 92.6%의 효율을 달성했다.표 1은 멀티 페이즈 벅 컨버터의 성능 비교를 요약한 것이다. 모든 비교 대상은 동일한 조건에서 멀티 페이즈 벅 컨버터를 사용하였으며, 다양한 입력 전압 범위가 설정되었다. 비교 연구에서 최대 허용 출력 전 류는 12A였으나, 본 연구에서는 최대 출력 전류 60A 를 구동할 수 있는 능력을 보여주어 우수한 성능을 입",
    "참고문헌[1] H. P. Forghani-Zadeh and G. A. Rincon-Mora, “Current-sensing techniques for dc-dc converters,” in The 2002 45th Midwest Symposium on Circuits and Systems, 2002. MWSCAS-2002., vol. 2. IEEE, 2002, pp.II–II.[2] N. Desai, H. K. Krishnamurthy, K. Ahmed, S. Weng, S. Kim, X. Liu, H. T. Do, K. Radhak- rishnan, K. Ravichandran, J. W. Tschanz et al.,2024 HSA SSS] Srsechsl EEA ry“17.4 peak-current-controlled ganged integrated high-frequency buck voltage regulators in 22nm cmos for robust cross-tile current sharing,” in 2021 IEEE International Solid-State Circuits Conference (ISSCC), vol. 64. IEEE, 2021, pp. 262–264.[3] S. Kim, H. Krishnamurthy, S. Amin, S. Weng, J. Feng, H. Do, K. Radhakrishnan, K. Ravichandran, J. Tschanz, and V. De, “A 1s direct-battery- attach integrated buck voltage regulator with 5- stack thin-gate 22nm finfet cmos featuring active voltage balancing and cascaded self- turn-on drivers,” in 2021 Symposium on VLSI Circuits. IEEE, 2021, pp. 1–2.[4] C. Schaef, T. Salus, R. Rayess, S. Kulasekaran, M. Manusharow, K. Radhakrishnan, and J. Douglas, “A 12a iOUT fully integrated multi- phase voltage regulator with 91.5% peak efficiency at 1.8 to 1v, operating at 50mhz and featuring a digitally assisted controller with automatic phase shedding and soft switching in 4nm class finfet cmos,” in 2022 IEEE International Solid-State Circuits Conference (ISSCC), vol. 65. IEEE, 2022, pp. 1–3.[5] K. Tang, Y. Ji, and L. Cheng, “A 6-phase integrated voltage regulator with multiphase transient optimization technique in 28-nm cmos process,” IEEE Transactions on Circuits and Systems II: Express Briefs, 2024."
]